let klasa = "slika1"
let slika = document.getElementById("s");


let tekstPolje = document.getElementById("tekst");
let tekst = [
    "Најстарије помињање листе светских чуда потиче од историчара Херодота (око 450. г. п. н. е.). Први пут свих седам чуда су заједно поменута у епиграму феничанског писца Антипатроса из Сидона (2. век п. н. е.), који је описао путопис по источном Медитерану свога времена. Грци су овај списак назвали: Τὰ ἑπτὰ θεάματα τῆς οἰκουμένης [γῆς] – „Седам атракција насељене Земље које треба обавезно видети“. Седам чуда је вероватно одабрано зато што је овај број за старе Грке имао симболику магичног броја. Опис седам светских чуда се налази у трактату из 6. века нове ере „О седам светских чуда“ (De septem mundi miraculis). Седам свјетских чуда старог свјета су скуп архитектонских дела које су стари Грци, нарочито у хеленистичкој епохи, сматрали врхунцем људске креативности и генијалности. Међутим сва чуда су у рушевинама осим великих пирамида у Гизи. Седам светских чуда старог света је међународно такмичење одржано 2007. године на иницијативу Бернарда Вебера, оснивача „Нове отворене светске корпорације“, која је и организовала овај догађај.",
    "Артемидин храм у Ефесу (грч. Artemision) је био грчки храм посвећен богињи Артемиди, подигнут око 550. п. н. е. Данас се од храма могу видети само остаци темеља и место на којем се овај храм некада налазио, недалеко од турског града Селчука и на око 50 km од града Измира. Иако темељ храма потиче још из 7. века п. н. е, грађевина је конструисана и подигнута 550. године п. н. е. Новац за изградњу велелепног мермерног храма издвојио је лидијски краљ Крез, а храм је осмислио и пројектовао грчки архитекта Херосифрон. Храм је био украшен бронзаним статуама које су извајали најумешнији уметници тог доба: Фидија, Поликлеит, Кресилас и Фрадмон. Артемидин храм у Ефесу (грч. Artemision) је био грчки храм посвећен богињи Артемиди, подигнут око 550. п. н. е. Данас се од храма могу видети само остаци темеља и место на којем се овај храм некада налазио, недалеко од турског града Селчука и на око 50 km од града Измира. Иако темељ храма потиче још из 7. века п. н. е, грађевина је конструисана и подигнута 550. године п. н. е. Новац за изградњу велелепног мермерног храма издвојио је лидијски краљ Крез, а храм је осмислио и пројектовао грчки архитекта Херосифрон. Храм је био украшен бронзаним статуама које су извајали најумешнији уметници тог доба: Фидија, Поликлеит, Кресилас и Фрадмон.",
    "Кеопсова пирамида (египатско име: Ахет Куфу - „Кеопсов хоризонт“, старогрч. ἡ μεγάλη Πύραμις τοῦ Хέοπος, лат. Magna Pyramis Cheopis) је највећа и најстарија од три пирамиде код Гизе и уједно највећа пирамида на свету. Често је називају једноставно: „Велика пирамида“. Пирамида је изграђена као гробница египатског фараона четврте египатске династије Кеопса (Куфуа) у XXVI веку п. н. е. Кеопсова пирамида (египатско име: Ахет Куфу - „Кеопсов хоризонт“, старогрч. ἡ μεγάλη Πύραμις τοῦ Хέοπος, лат. Magna Pyramis Cheopis) је највећа и најстарија од три пирамиде код Гизе и уједно највећа пирамида на свету. Често је називају једноставно: „Велика пирамида“. Пирамида је изграђена као гробница египатског фараона четврте египатске династије Кеопса (Куфуа) у XXVI веку п. н. е. Кеопсова пирамида (египатско име: Ахет Куфу - „Кеопсов хоризонт“, старогрч. ἡ μεγάλη Πύραμις τοῦ Хέοπος, лат. Magna Pyramis Cheopis) је највећа и најстарија од три пирамиде код Гизе и уједно највећа пирамида на свету. Често је називају једноставно: „Велика пирамида“. Пирамида је изграђена као гробница египатског фараона четврте египатске династије Кеопса (Куфуа) у XXVI веку п. н. е.",
    "Висећи вртови из Вавилона (такође означавани и као Семирамидини висећи вртови), су једно од седам светских чуда. На основу митова били су изграђени за краљицу Семирамиду, која је пореклом из зелене Медије и због тога је краљ Навукодоносор II наредио око 600. п. н. е. да се изграде висећи вртови на терасама палате да би је орасположио. О њиховој егзистенцији не постоје веродостојни докази. Висеће вртове су описивали углавном старогрчки историчари Страбон и Диодор Сицилијски. Висећи вртови из Вавилона (такође означавани и као Семирамидини висећи вртови), су једно од седам светских чуда. На основу митова били су изграђени за краљицу Семирамиду, која је пореклом из зелене Медије и због тога је краљ Навукодоносор II наредио око 600. п. н. е. да се изграде висећи вртови на терасама палате да би је орасположио. О њиховој егзистенцији не постоје веродостојни докази. Висеће вртове су описивали углавном старогрчки историчари Страбон и Диодор Сицилијски. Висећи вртови из Вавилона (такође означавани и као Семирамидини висећи вртови), су једно од седам светских чуда. На основу митова били су изграђени за краљицу Семирамиду, која је пореклом из зелене Медије и због тога је краљ Навукодоносор II наредио око 600. п. н. е. да се изграде висећи вртови на терасама палате да би је орасположио. О њиховој егзистенцији не постоје веродостојни докази. Висеће вртове су описивали углавном старогрчки историчари Страбон и Диодор Сицилијски.",
    "Колос сa Родоса (грч. Κολοσσός της Ρόδου) је једно од седам светских чуда старог света. Иако је од времена изградње ове огромне статуе до њеног уништења протекло свега 56 година, ова својеврсна и непоновљива грађевина свакако је заслужила своје место међу светским чудима. Колос са Родоса није само гигантска статуа - она је симбол јединства народа који је насељавао Родос, прелепо медитеранско острво. Колос сa Родоса (грч. Κολοσσός της Ρόδου) је једно од седам светских чуда старог света. Иако је од времена изградње ове огромне статуе до њеног уништења протекло свега 56 година, ова својеврсна и непоновљива грађевина свакако је заслужила своје место међу светским чудима. Колос са Родоса није само гигантска статуа - она је симбол јединства народа који је насељавао Родос, прелепо медитеранско острво. Колос сa Родоса (грч. Κολοσσός της Ρόδου) је једно од седам светских чуда старог света. Иако је од времена изградње ове огромне статуе до њеног уништења протекло свега 56 година, ова својеврсна и непоновљива грађевина свакако је заслужила своје место међу светским чудима. Колос са Родоса није само гигантска статуа - она је симбол јединства народа који је насељавао Родос, прелепо медитеранско острво.",
    "Маузолеј у Халикарнасу (грч. Μαυσωλεῖον Ἁλικαρνασσεύς), један од седам светских чуда, био је надгробни споменик каријског краља Маузола. Био је изграђен на површини од 30 x 40 m, а висок 45 m. Слично Великој пирамиди у Египту, и ово место представља гроб једног античког владара. Ипак, Маузолеј се разликује од пирамида по много чему - између осталог, лепота грађевине је та која је, више него њена величина, задивила милионе људи од времена изградње па све до данас. Маузолеј се налазио у граду Бодруму (у старогрчко доба Халикарнас), на обали Егејског мора, у југозападном делу данашње Турске. Ову грађевину су дизајнирали грчки архитекти Сатирос и Питијус. Маузолеј у Халикарнасу (грч. Μαυσωλεῖον Ἁλικαρνασσεύς), један од седам светских чуда, био је надгробни споменик каријског краља Маузола. Био је изграђен на површини од 30 x 40 m, а висок 45 m. Слично Великој пирамиди у Египту, и ово место представља гроб једног античког владара. Ипак, Маузолеј се разликује од пирамида по много чему - између осталог, лепота грађевине је та која је, више него њена величина, задивила милионе људи од времена изградње па све до данас. Маузолеј се налазио у граду Бодруму (у старогрчко доба Халикарнас), на обали Егејског мора, у југозападном делу данашње Турске. Ову грађевину су дизајнирали грчки архитекти Сатирос и Питијус. Маузолеј у Халикарнасу (грч. Μαυσωλεῖον Ἁλικαρνασσεύς), један од седам светских чуда, био је надгробни споменик каријског краља Маузола. Био је изграђен на површини од 30 x 40 m, а висок 45 m. Слично Великој пирамиди у Египту, и ово место представља гроб једног античког владара. Ипак, Маузолеј се разликује од пирамида по много чему - између осталог, лепота грађевине је та која је, више него њена величина, задивила милионе људи од времена изградње па све до данас. Маузолеј се налазио у граду Бодруму (у старогрчко доба Халикарнас), на обали Егејског мора, у југозападном делу данашње Турске. Ову грађевину су дизајнирали грчки архитекти Сатирос и Питијус.",
    "Статуа Зевса у Олимпији је једно од седам светских чуда, посвећена је богу Зевсу – врховном богу старих Грка у чију част су се одржавале Олимпијске игре, а налазила се на простору саме Олимпије по којој су игре и добиле назив. У време Олимпијских игара престајали су ратови, а атлете из Мале Азије, Сирије, Египта и Сицилије су долазили да прославе Олимпијаду и обожавају свог бога над боговима – Зевса. Статуа се налазила у самом граду Олимпији, на западној обали данашње Грчке, око 150 километара западно од Атине. Статуа Зевса у Олимпији је једно од седам светских чуда, посвећена је богу Зевсу – врховном богу старих Грка у чију част су се одржавале Олимпијске игре, а налазила се на простору саме Олимпије по којој су игре и добиле назив. У време Олимпијских игара престајали су ратови, а атлете из Мале Азије, Сирије, Египта и Сицилије су долазили да прославе Олимпијаду и обожавају свог бога над боговима – Зевса. Статуа се налазила у самом граду Олимпији, на западној обали данашње Грчке, око 150 километара западно од Атине. Статуа Зевса у Олимпији је једно од седам светских чуда, посвећена је богу Зевсу – врховном богу старих Грка у чију част су се одржавале Олимпијске игре, а налазила се на простору саме Олимпије по којој су игре и добиле назив. У време Олимпијских игара престајали су ратови, а атлете из Мале Азије, Сирије, Египта и Сицилије су долазили да прославе Олимпијаду и обожавају свог бога над боговима – Зевса. Статуа се налазила у самом граду Олимпији, на западној обали данашње Грчке, око 150 километара западно од Атине.",
    "Светионик у Александрији (грч. ὁ Φάρος τῆς Ἀλεξανδρείας) једно је од седам светских чуда. Направљен је између 300. и 280. п. н. е. на полуoстрву Фаросу.[1]‍:p. 11 Направио га је грчки архитекта Сострат. Од свих светских чуда, једино је светионик у Александрији, поред своје архитектонске чудесности, имао и практичну намену — омогућавао је бродовима безбедан повратак у Велику луку Александрије. У архитектонском смислу, овај светионик је ипак имао највећи значај — то је била највиша грађевина на свету у то време и њена светлост се могла видети на 50 km од александријске обале. Светионик у Александрији (грч. ὁ Φάρος τῆς Ἀλεξανδρείας) једно је од седам светских чуда. Направљен је између 300. и 280. п. н. е. на полуoстрву Фаросу.[1]‍:p. 11 Направио га је грчки архитекта Сострат. Од свих светских чуда, једино је светионик у Александрији, поред своје архитектонске чудесности, имао и практичну намену — омогућавао је бродовима безбедан повратак у Велику луку Александрије. У архитектонском смислу, овај светионик је ипак имао највећи значај — то је била највиша грађевина на свету у то време и њена светлост се могла видети на 50 km од александријске обале. Светионик у Александрији (грч. ὁ Φάρος τῆς Ἀλεξανδρείας) једно је од седам светских чуда. Направљен је између 300. и 280. п. н. е. на полуoстрву Фаросу.[1]‍:p. 11 Направио га је грчки архитекта Сострат. Од свих светских чуда, једино је светионик у Александрији, поред своје архитектонске чудесности, имао и практичну намену — омогућавао је бродовима безбедан повратак у Велику луку Александрије. У архитектонском смислу, овај светионик је ипак имао највећи значај — то је била највиша грађевина на свету у то време и њена светлост се могла видети на 50 km од александријске обале.",
    "Мачу Пикчу је свети град Инка који се налази на Андима. Надморска висина је 2.350 метара. Он је смештен усред бујне вегетације коју наводњава река. Инке су га изградиле око 1300. године. Пронашао га је 1911. Американац Хајрам Бингам. Археолози тврде да је Мачу Пикчу био царски посед и религијско уточиште или тајни церемонијални град. Има око двеста грађевина. Изграђени су и канали за наводњавање. У центру града постоји жртвеник Инка, за који се мисли да може бити и опсерваторија. Зидине су изграђене од блокова камена.",
    "Изградњу је започео Птолемеј I Сотер око 290. године п. н. е, а она је завршена након његове смрти, током владавине његовог сина Птолемеја Филаделфа. Состратус, Еуклидов савременик, био је архитекта светионика, али су детаљне прорачуне за грађевину извршили научници александријске библиотеке-музеја. Како сведочи грчки писац Страбон трошкови изградње светионика били су изузетно велики. Легенда каже да је Сострат, дуго трагао за грађевинским материјалом за темељ, који би могао одупрети морској води. Најзад је свој џиновски торањ сместио на огромне стаклене блокове. Светионик је био висок преко 117 m и у подножју имао око 300 соба.. На највишем спрату ноћу је горела ватра, а дању се сигнализирало огледалима. Фарос је морепловцима из свих крајева света омогућавао да безбедно уплове у луку Александрије. Изградњу је започео Птолемеј I Сотер око 290. године п. н. е, а она је завршена након његове смрти, током владавине његовог сина Птолемеја Филаделфа. Состратус, Еуклидов савременик, био је архитекта светионика, али су детаљне прорачуне за грађевину извршили научници александријске библиотеке-музеја. Како сведочи грчки писац Страбон трошкови изградње светионика били су изузетно велики. Легенда каже да је Сострат, дуго трагао за грађевинским материјалом за темељ, који би могао одупрети морској води. Најзад је свој џиновски торањ сместио на огромне стаклене блокове. Светионик је био висок преко 117 m и у подножју имао око 300 соба.. На највишем спрату ноћу је горела ватра, а дању се сигнализирало огледалима. Фарос је морепловцима из свих крајева света омогућавао да безбедно уплове у луку Александрије. Изградњу је започео Птолемеј I Сотер око 290. године п. н. е, а она је завршена након његове смрти, током владавине његовог сина Птолемеја Филаделфа. Состратус, Еуклидов савременик, био је архитекта светионика, али су детаљне прорачуне за грађевину извршили научници александријске библиотеке-музеја. Како сведочи грчки писац Страбон трошкови изградње светионика били су изузетно велики. Легенда каже да је Сострат, дуго трагао за грађевинским материјалом за темељ, који би могао одупрети морској води. Најзад је свој џиновски торањ сместио на огромне стаклене блокове. Светионик је био висок преко 117 m и у подножју имао око 300 соба.. На највишем спрату ноћу је горела ватра, а дању се сигнализирало огледалима. Фарос је морепловцима из свих крајева света омогућавао да безбедно уплове у луку Александрије."
]

tekstPolje.innerHTML = tekst[0]





document.getElementById("s1").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika1");

    tekstPolje.innerHTML = tekst[0];
    klasa = "slika1";
})

document.getElementById("s2").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika2");

    tekstPolje.innerHTML = tekst[1];
    klasa = "slika2";
})

document.getElementById("s3").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika3");

    tekstPolje.innerHTML = tekst[2];
    klasa = "slika3";
})

document.getElementById("s4").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika4");

    tekstPolje.innerHTML = tekst[3];
    klasa = "slika4";
})

document.getElementById("s5").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika5");

    tekstPolje.innerHTML = tekst[4];
    klasa = "slika5";
})

document.getElementById("s6").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika6");

    tekstPolje.innerHTML = tekst[5];
    klasa = "slika6";
})

document.getElementById("s7").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika7");

    tekstPolje.innerHTML = tekst[6];
    klasa = "slika7";
})

document.getElementById("s8").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika8");

    tekstPolje.innerHTML = tekst[7];
    klasa = "slika8";
})

document.getElementById("s9").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika9");

    tekstPolje.innerHTML = tekst[8];
    klasa = "slika9";
})

document.getElementById("s10").addEventListener("click", ()=>{
    slika.classList.remove(klasa);
    slika.classList.add("slika10");

    tekstPolje.innerHTML = tekst[9];
    klasa = "slika10";
})




document.getElementById("uputstvo").addEventListener("click", ()=>{
    window.location.href = "./stranice/Uputstvo/uputstvo.html"
})

document.getElementById("autor").addEventListener("click", ()=>{
    window.location.href = "./stranice/OMeni/omeni.html"
})